# Условие задачи (на русском):
# Дан массив 'nums' и число 'target'. Нужно найти все УНИКАЛЬНЫЕ четверки чисел,
# сумма которых равна 'target'.
# Одно и то же число по конкретному индексу нельзя использовать дважды в одной четверке.
#
# Пример: nums = [1, 0, -1, 0, -2, 2], target = 0
# Ответ: [[-2,-1,1,2], [-2,0,0,2], [-1,0,0,1]]
#
# -----------------------------------------------------------------------------
# Алгоритм решения: Сортировка + Два вложенных цикла + Два указателя
#
# Идея:
# 1. Мы фиксируем ПЕРВОЕ число (i).
# 2. Мы фиксируем ВТОРОЕ число (j).
# 3. Оставшиеся два числа (left и right) ищем методом двух указателей,
#    как в обычной задаче 2Sum/3Sum.
#
# Важный момент: Чтобы избежать дубликатов в ответе, мы должны пропускать
# одинаковые числа на каждом уровне (i, j, left, right).
#
# 1. Сортируем массив (это база для работы двух указателей).
# 2. Цикл i от 0 до n-4:
#    - Пропускаем дубликаты для i.
#    - Цикл j от i+1 до n-3:
#      - Пропускаем дубликаты для j.
#      - Устанавливаем left = j + 1, right = n - 1.
#      - Пока left < right:
#        - Считаем текущую сумму четырех чисел.
#        - Если сумма == target: добавляем в ответ, сдвигаем left и right,
#          пропуская их дубликаты.
#        - Если сумма < target: двигаем left вправо.
#        - Если сумма > target: двигаем right влево.

import time


class Solution(object):
    def fourSum(self, nums, target):
        nums.sort()
        n = len(nums)
        res = []

        for i in range(n):
            # Пропускаем дубликаты для первого числа
            if i > 0 and nums[i] == nums[i - 1]:
                continue

            for j in range(i + 1, n):
                # Пропускаем дубликаты для второго числа
                if j > i + 1 and nums[j] == nums[j - 1]:
                    continue

                # Стандартные два указателя для поиска остатка суммы
                left, right = j + 1, n - 1
                while left < right:
                    total = nums[i] + nums[j] + nums[left] + nums[right]

                    if total == target:
                        res.append([nums[i], nums[j], nums[left], nums[right]])
                        left += 1
                        right -= 1
                        # Пропускаем дубликаты для третьего и четвертого числа
                        while left < right and nums[left] == nums[left - 1]:
                            left += 1
                        while left < right and nums[right] == nums[right + 1]:
                            right -= 1
                    elif total < target:
                        left += 1
                    else:
                        right -= 1
        return res


if __name__ == '__main__':
    solution = Solution()

    print(solution.fourSum([1, 2, 1, 3, 1, 2, 3, 4, 5, 6, 2, 7, 8, 9, 0, -2, -6, -4, -3], 7))


    start = time.time()
    result = solution.fourSum([1, 0, -1, 0, -2, 2], 0)
    print(result, '{:.4f}'.format(time.time() - start))
    # assert result == [[-2, -1, 1, 2], [-2, 0, 0, 2], [-1, 0, 0, 1]]

    start = time.time()
    result = solution.fourSum([2, 2, 2, 2, 2], 8)
    print(result, '{:.4f}'.format(time.time() - start))
    # assert result == [[2, 2, 2, 2]]

    start = time.time()
    result = solution.fourSum(
        [-500, -481, -480, -469, -437, -423, -408, -403, -397, -381, -379, -377, -353, -347, -337, -327, -313, -307,
         -299, -278, -265, -258, -235, -227, -225, -193, -192, -177, -176, -173, -170, -164, -162, -157, -147, -118,
         -115, -83, -64, -46, -36, -35, -11, 0, 0, 33, 40, 51, 54, 74, 93, 101, 104, 105, 112, 112, 116, 129, 133, 146,
         152, 157, 158, 166, 177, 183, 186, 220, 263, 273, 320, 328, 332, 356, 357, 363, 372, 397, 399, 420, 422, 429,
         433, 451, 464, 484, 485, 498, 499], 2139)
    print(result, '{:.4f}'.format(time.time() - start))
    # assert result == []

    start = time.time()
    result = solution.fourSum(
        [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 20, 20, 20, 20, 20, 20, 20, 20,
         20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30,
         30, 30, 30, 30, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 50, 50, 50, 50,
         50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60,
         60, 60, 60, 60, 60, 60, 60, 60, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70,
         80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 90, 90, 90, 90, 90, 90, 90, 90,
         90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90], 200)
    print(result, '{:.4f}'.format(time.time() - start))
    # assert result == []
